

class  Sound{
    public static void main(String[] args) {
        double dist;
        dist= 335 * 7.2;
        System.out.println("Место вспышки молнии находится на расстоянии "
                + dist + " метров.");



        /*
        Дополнительная задача рассчитать расстояние до крупного объекта вроде
        скалы можно по времени прихода эхо. Например, если вы хлопнете в
        ладоши и измерите время, через которое стало слышно эхо, то узнаете
        общее время прохождения звука туда и обратно. Разделив это значение на
        два, вы получите время, за которое звук проходит в одну сторону. Затем
        результирующее значение можно использовать для расчета расстояния до
        объекта. Модифицируйте предыдущую программу так, чтобы она вычисляла
        расстояние, исходя из предположения о том, что временной интервал представляет
        собой промежуток времени до прихода эхo
        */
    }
}